content/notes/20210831225847-my_braindump.md
+++
title = "My braindump"
author = ["Бадыков Айрат"]
draft = false
+++

[My Braindump](https://braindump.badykov.com/about/) is generated with [ox-hugo](https://github.com/kaushalmodi/ox-hugo) from my [Org-Roam]({{<relref "20210831213556-org_roam.md#" >}}) notes. The current idea for it is to be my personal knowledge system.


## Related links: {#related-links}

-   [github repo](https://github.com/ayrat555/braindump) - my braindump is hosted on github with github pages
-   [cortex-dark](https://github.com/ayrat555/cortex-dark) - hugo theme for the braindump


## Backlog: {#backlog}

-   Simplify the process of exporting notes

-   Maintain two sets of notes.

    Public notes will be used in the braindump. Private notes will be used for personal thoughts, projects and ideas

-   Add additional info to notes (created at, updated at, etc)

-   Take a look at the issue when there are too many stacked pages

-   Add analytics

-   Add a list of my posts

-   Add README to the Repo


## Thoughts: {#thoughts}

-   Should I dump (:]) by braindump weekly ?


## Good looking braindumps from other people: {#good-looking-braindumps-from-other-people}

-   <https://bphenriques.github.io/knowledge-base/>
-   <https://notes.arne.me/about-these-notes/>
